src/toir_cfe/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf35ff03-c641-42bf-90fc-6469235dafc0">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="8b164589-2f76-44c2-86db-13b16b9df744">
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2cd062c3-ed73-4f60-acc5-8ad2b64fc56a">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/InformationRegisters/НаличиеФайлов/НаличиеФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="060b2bb4-ca03-4da9-930f-7f91f6299a35">
  <name>НаличиеФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="394b1a1c-a7ae-41b7-a346-4bac99fa567d">
    <name>ЕстьФайлы</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="ccfe4e36-80b6-419f-8bb3-c1046203d023">
    <name>ОбъектСФайлами</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Documents/торо_ВыявленныеДефекты/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура проф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	//++ Проф-ИТ, #169, Башинская А.Ю., 10.08.2023
	Список.ТекстЗапроса = проф_ПолучитьТекстЗапроса();
	
	//Добавление колонок списка
	Список.КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	   
	НовЭлемент = Элементы.Добавить("проф_КрайнееВремяУстранения", Тип("ПолеФормы"), Элементы.Список);
	НовЭлемент.Вид	 = ВидПоляФормы.ПолеНадписи;
	НовЭлемент.ПутьКДанным	= "Список.проф_КрайнееВремяУстранения";	
	НовЭлемент.Заголовок	= "Крайнее время устранения";
	
	НовЭлемент = Элементы.Добавить("проф_ТипЗаказа", Тип("ПолеФормы"), Элементы.Список);
	НовЭлемент.Вид	 = ВидПоляФормы.ПолеНадписи;
	НовЭлемент.ПутьКДанным	= "Список.проф_ТипЗаказа";	
	НовЭлемент.Заголовок	= "Тип заказа";

	НовЭлемент = Элементы.Добавить("проф_РемБаза", Тип("ПолеФормы"), Элементы.Список);
	НовЭлемент.Вид	 = ВидПоляФормы.ПолеНадписи;
	НовЭлемент.ПутьКДанным	= "Список.проф_РемБаза";	
	НовЭлемент.Заголовок	= "Ближайшая ремонтная база";
    //-- Проф-ИТ, #169, Башинская А.Ю., 10.08.2023

КонецПроцедуры

#КонецОбласти      

#Область СлужебныеПроцедурыИФункции

//++ Проф-ИТ, #169, Башинская А.Ю., 10.08.2023

Функция проф_ПолучитьТекстЗапроса()
	
	Возврат  "ВЫБРАТЬ
			|	Документторо_ВыявленныеДефекты.Ссылка КАК Ссылка,
			|	Документторо_ВыявленныеДефекты.ПометкаУдаления КАК ПометкаУдаления,
			|	Документторо_ВыявленныеДефекты.Номер КАК Номер,
			|	Документторо_ВыявленныеДефекты.Дата КАК Дата,
			|	Документторо_ВыявленныеДефекты.Проведен КАК Проведен,
			|	Документторо_ВыявленныеДефекты.ДатаОбнаружения КАК ДатаОбнаружения,
			|	Документторо_ВыявленныеДефекты.ДефектВыявленВПроцессе КАК ДефектВыявленВПроцессе,
			|	Документторо_ВыявленныеДефекты.Комментарий КАК Комментарий,
			|	Документторо_ВыявленныеДефекты.Организация КАК Организация,
			|	Документторо_ВыявленныеДефекты.Подразделение КАК Подразделение,
			|	Документторо_ВыявленныеДефекты.Инициатор КАК Инициатор,
			|	Документторо_ВыявленныеДефекты.Ответственный КАК Ответственный,
			|	Документторо_ВыявленныеДефекты.СпособСогласования КАК СпособСогласования,
			|	торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК СтатусСогласования,
			|	Документторо_ВыявленныеДефекты.МоментВремени КАК МоментВремени,
			|	Документторо_ВыявленныеДефекты.ОбъектРемонта КАК ОбъектРемонта,
			|	Документторо_ВыявленныеДефекты.ИзМобильного КАК ИзМобильного,
			|	торо_СтатусыДокументов.Статус КАК СтатусДокумента,
			|	ВЫБОР
			|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
			|			ТОГДА 1
			|		КОГДА НаличиеФайлов.ЕстьФайлы
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК ЕстьФайлы,
			|	Документторо_ВыявленныеДефекты.ОбъектыРемонтаСтрокой КАК ОбъектыРемонтаСтрокой,
			|	Документторо_ВыявленныеДефекты.проф_КрайнееВремяУстранения КАК проф_КрайнееВремяУстранения,
			|	Документторо_ВыявленныеДефекты.проф_ТипЗаказа КАК проф_ТипЗаказа,
			|	Документторо_ВыявленныеДефекты.проф_РемБаза КАК проф_РемБаза
			|ИЗ
			|	Документ.торо_ВыявленныеДефекты КАК Документторо_ВыявленныеДефекты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
			|		ПО Документторо_ВыявленныеДефекты.Ссылка = НаличиеФайлов.ОбъектСФайлами
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СтатусыДокументов.СрезПоследних(, ) КАК торо_СтатусыДокументов
			|		ПО Документторо_ВыявленныеДефекты.Ссылка = торо_СтатусыДокументов.ИзменяемыйДокумент
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
			|		ПО (торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = Документторо_ВыявленныеДефекты.Ссылка)";
	
конецФункции

//-- Проф-ИТ, #169, Башинская А.Ю., 10.08.2023

#КонецОбласти
